-- ============================================================
--  Clario - "Clarity in every client."
--  Ερώτημα 7: Καταγραφή ενέργειας στο ιστορικό
-- ============================================================
--  Σενάριο: Καταγραφή ότι ο υπάλληλος 2 άνοιξε την
--           καρτέλα του πελάτη 1
-- ============================================================

USE `clario`;

INSERT INTO action
    (employee_id, timestamp, action_type, client_id, ip_address)
VALUES
    (2, NOW(), 'view_client', 1, '192.168.1.2');